package com.chudnovskiy.oleg.lesson06.homework;

/**
 * 4. Написать программу, которая определяет минимальное чис-
 * ло во введенной с клавиатуры последовательности положитель-
 * ных чисел (длина последовательности не ограничена). Ниже при-
 * веден рекомендуемый вид экрана программы
 *
 *
 * Определение минимального числа в последовательности положитель-
 * ных чисел.
 * Вводите после стрелки числа. Для завершения ввода введите ноль.
 * >12
 * >75
 * >10
 * >9
 * >23
 * >0
 */
public class Task04 {
}
