package com.chudnovskiy.oleg.lesson06.homework;

/**
 * 2. Написать программу проверки умения складывать и вычитать
 * числа в пределах 100. Программа должна вывести 10 примеров,
 * причем в каждом примере уменьшаемое должно быть больше или
 * равно вычитаемому, т. е. не допускается предлагать испытуемому
 * примеры с отрицательным результатом. Оценка выставляется по
 * следующему правилу: за 10 правильных ответов — "отлично",
 * за 9 и 8 — "хорошо", за 7 и 6 — "удовлетворительно", за 6 и ме-
 * нее — "плохо". Ниже приведен рекомендуемый вид экрана про-
 * граммы.
 *
 * Проверка умения складывать и вычитать числа.
 * После примера введите ответ и нажмите <Enter>
 * 75-4=71
 * 35-9=29
 * Вы ошиблись! 35-9=26
 * 14-1=13
 * 6-5=1
 * 37-19=28
 * Вы ошиблись! 37-19=18
 * 53-14=39
 * 94-87=7
 * 90-16=74
 * 4-2=2
 * 89-41=48
 * Правильных ответов: 8
 * Оценка: Хорошо
 */
public class Task02 {
}
