package com.chudnovskiy.oleg.lesson06.homework;

/**
 * 1. Написать программу проверки знания таблицы умножения.
 * Программа должна вывести 10 примеров и выставить оценку: за
 * 10 правильных ответов — "отлично", за 9 и 8 — "хорошо", за 7 и
 * 6 — "удовлетворительно", за 6 и менее — "неудовлетворитель-
 * но". Ниже приведен рекомендуемый вид экрана программы.
 *
 *
 * *** Проверка знания таблицы умножения ***
 * После примера введите ответ и нажмите <Enter>.
 * 5x3=15
 * 7х7=49
 * 1х4=4
 * 4х3=12
 * 9х4=36
 * 8х8=64
 * 7х8=52
 * Вы ошиблись! 7х8=56
 * 4х7=28
 * 3х5=15
 * 2х5=10
 * Правильных ответов: 9
 * Оценка: Хорошо.
 */
public class Task01 {
}
