package com.chudnovskiy.oleg.lesson3.homework;

/**
 * Задание 1
 * Пользователь вводит с клавиатуры число. Необходи-
 * мо проверить его на четность и нечетность. Если число
 * четное требуется вывести на экран число и надпись «Even
 * number». Если число нечетное выведите на экран число
 * и надпись «Odd number».
 * Задание 2
 * Пользователь вводит с клавиатуры три числа. В за-
 * висимости от выбора пользователя программа выводит
 * на экран сумму трёх чисел или произведение трёх чисел.
 * Задание 3
 * Пользователь вводит с клавиатуры три числа. В за-
 * висимости от выбора пользователя программа выводит
 * на экран максимум из трёх, минимум из трёх или сред-
 * неарифметическое трёх чисел.
 * Задание 4
 * Пользователь вводит с клавиатуры количество ме-
 * тров. В зависимости от выбора пользователя программа
 * переводит метры в мили, дюймы или ярды.Практические задания
 * 1
 * Задание 5
 * Пользователь с клавиатуры вводит количество часов.
 * Если полученное значение находится в диапазоне от 0 до
 * 6 нужно вывести надпись «Good Night», если в диапазоне
 * от 6 до 13 «Good Morning», если в диапазоне от 13 до 17
 * «Good Day», если в диапазоне от 17 до 0 «Good Evening».
 * Верхняя граница диапазона не включается. Например,
 * число 6 относится к 6 до 13
 */
public class App {
}
