package com.chudnovskiy.oleg.less201222.classwork;

/**
 * Створити двовимірний масив розміром 10х10 елементів і заповнити значеннями таблиці множення (таблиці Піфагора).
 * Надрукувати таблицю в консоль
 * Заповнити масив 10х10 елементів випадковими числами від 1 до 1001. Відсортувати парні рядки за зростанням значень елементів, непарні - за спаданням значення елементів. Надрукувати результуючий масив.
 * Додаткове завдання (замість 2). Сортування відбувається не по рядкам, а по колонках
 */
public class LessonApp {
}
