package com.chudnovskiy.oleg.less091222.homework;

/**
 * 3. Написать программу, которая выводит на экран таблицу со-
 * ответствия температуры в градусах Цельсия и Фаренгейта
 * (F°= 5/9·C° + 32). Диапазон изменения температуры в градусах
 * Цельсия и шаг должны вводиться во время работы программы.
 * Рекомендуемый вид экрана приведен ниже.
 *
 * t1 –> 0
 * t2 –> 10
 * dt–> 1
 * -----------------
 * C F
 * -----------------
 * 0.00 32.00
 * 1.00 33.80
 * 2.00 35.60
 * 3.00 37.40
 * 4.00 39.20
 * 5.00 41.00
 * 6.00 42.80
 * 7.00 44.60
 * 8.00 46.40
 * 9.00 48.20
 * 10.00 50.00
 * -----------------
 */
public class Task03 {
}
